# Pandas

In [2]:
import pandas as pd

In [3]:
df = pd.read_csv("D:\\MY-Skills\\SCRIPTING_LANGUAGES\\Python\\cars - Sheet1.csv")
df

,Unnamed: 0,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight
0,0,13500,1.917,46986,Diesel,90,1,0,2000,three,1165
1,1,13750,1.917,72937,Diesel,90,1,0,2000,3,1165
2,3,14950,2.167,48000,Diesel,90,0,0,2000,3,1165
3,4,13750,2.500,38500,Diesel,90,0,0,2000,3,1170
4,5,12950,2.667,61000,Diesel,90,0,0,2000,3,1170
...,...,...,...,...,...,...,...,...,...,...,...
1187,1429,8950,6.500,24000,Petrol,86,1,1,1300,5,1065
1188,1430,8450,6.667,23000,Petrol,86,0,0,1300,3,1015
1189,1432,10845,6.000,0,Petrol,86,0,0,1300,3,1015
1190,1434,7250,5.833,0,NaN,86,1,0,1300,3,1015
1191,1435,6950,6.333,1,Petrol,110,0,0,1600,5,1114

In [4]:
df.head()

,Unnamed: 0,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight
0,0,13500,1.917,46986,Diesel,90,1,0,2000,three,1165
1,1,13750,1.917,72937,Diesel,90,1,0,2000,3,1165
2,3,14950,2.167,48000,Diesel,90,0,0,2000,3,1165
3,4,13750,2.500,38500,Diesel,90,0,0,2000,3,1170
4,5,12950,2.667,61000,Diesel,90,0,0,2000,3,1170

In [5]:
df.loc[1189,"Price"]

np.int64(10845)

In [6]:
df.tail()

,Unnamed: 0,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight
1187,1429,8950,6.500,24000,Petrol,86,1,1,1300,5,1065
1188,1430,8450,6.667,23000,Petrol,86,0,0,1300,3,1015
1189,1432,10845,6.000,0,Petrol,86,0,0,1300,3,1015
1190,1434,7250,5.833,0,NaN,86,1,0,1300,3,1015
1191,1435,6950,6.333,1,Petrol,110,0,0,1600,5,1114

In [7]:
df.iloc[1189, 1]

np.int64(10845)

In [8]:
df.dtypes

Unnamed: 0      int64
Price           int64
Age           float64
KM              int64
FuelType       object
HP             object
MetColor        int64
Automatic       int64
CC              int64
Doors          object
Weight          int64
dtype: object

In [9]:
df.index

RangeIndex(start=0, stop=1192, step=1)

In [10]:
df.shape

(1192, 11)

In [11]:
df.ndim

2

In [12]:
df.columns

Index(['Unnamed: 0', 'Price', 'Age', 'KM', 'FuelType', 'HP', 'MetColor',
       'Automatic', 'CC', 'Doors', 'Weight'],
      dtype='object')

In [13]:
df.size

13112

In [14]:
df.T

,0,1,2,3,4,5,6,7,8,9,...,1182,1183,1184,1185,1186,1187,1188,1189,1190,1191
Unnamed: 0,0,1,3,4,5,7,8,10,11,12,...,1420,1421,1423,1424,1425,1429,1430,1432,1434,1435
Price,13500,13750,14950,13750,12950,18600,21500,20950,19950,19600,...,8150,8500,7950,7750,7950,8950,8450,10845,7250,6950
Age,1.917,1.917,2.167,2.5,2.667,2.5,2.25,2.083,1.833,2.083,...,6.333,6.5,6.667,6.083,6.667,6.5,6.667,6.0,5.833,6.333
KM,46986,72937,48000,38500,61000,75889,19700,31461,43610,32189,...,36537,0,35821,34717,0,24000,23000,0,0,1
FuelType,Diesel,Diesel,Diesel,Diesel,Diesel,NaN,Petrol,Petrol,Petrol,Petrol,...,NaN,Petrol,Petrol,Petrol,Petrol,Petrol,Petrol,Petrol,NaN,Petrol
HP,90,90,90,90,90,90,192,192,192,192,...,110,86,86,86,86,86,86,86,86,110
MetColor,1,1,0,0,0,1,0,0,0,0,...,0,0,0,0,1,1,0,0,1,0
Automatic,0,0,0,0,0,0,0,0,0,0,...,1,1,1,0,0,1,0,0,0,0
CC,2000,2000,2000,2000,2000,2000,1800,1800,1800,1800,...,1600,1300,1300,1300,1300,1300,1300,1300,1300,1600
Doors,three,3,3,3,3,3,3,3,3,3,...,4,3,3,3,4,5,3,3,3,5
Weight,1165,1165,1165,1170,1170,1245,1185,1185,1185,1185,...,1075,1045,1015,1015,1000,1065,1015,1015,1015,1114

In [15]:
df

,Unnamed: 0,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight
0,0,13500,1.917,46986,Diesel,90,1,0,2000,three,1165
1,1,13750,1.917,72937,Diesel,90,1,0,2000,3,1165
2,3,14950,2.167,48000,Diesel,90,0,0,2000,3,1165
3,4,13750,2.500,38500,Diesel,90,0,0,2000,3,1170
4,5,12950,2.667,61000,Diesel,90,0,0,2000,3,1170
...,...,...,...,...,...,...,...,...,...,...,...
1187,1429,8950,6.500,24000,Petrol,86,1,1,1300,5,1065
1188,1430,8450,6.667,23000,Petrol,86,0,0,1300,3,1015
1189,1432,10845,6.000,0,Petrol,86,0,0,1300,3,1015
1190,1434,7250,5.833,0,NaN,86,1,0,1300,3,1015
1191,1435,6950,6.333,1,Petrol,110,0,0,1600,5,1114

In [16]:
l1 = [1,[2,3],4]

In [17]:
import copy

In [18]:
ls = copy.copy(l1)
ls

[1, [2, 3], 4]

In [19]:
ls[1][0] = 20
ls

[1, [20, 3], 4]

In [20]:
ld = copy.deepcopy(l1)
ld

[1, [20, 3], 4]

In [21]:
ld[1][0] = 30
ld

[1, [30, 3], 4]

In [22]:
l1

[1, [20, 3], 4]

In [32]:
d1=pd.DataFrame(
    {'Student':['A','B','C','D'],
     'Marks':[90,80,40,60]
    })
d2=pd.DataFrame(
    {'Name':['E','F','G','H'],
     'Ranks':[50,40,30,20]
    })
# result=pd.concat([d1,d2],ignore_index=True)
result = d1.join(d2)
result

  Student  Marks Name  Ranks
0       A     90    E     50
1       B     80    F     40
2       C     40    G     30
3       D     60    H     20

In [24]:
df.isna().sum()

Unnamed: 0     0
Price          0
Age            0
KM             0
FuelType      81
HP             0
MetColor       0
Automatic      0
CC             0
Doors          0
Weight         0
dtype: int64

In [26]:
d1 = d1.assign(Grades=['A','B','C','D'])
d1

  Student  Marks Grades
0       A     90      A
1       B     80      B
2       C     70      C
3       D     60      D

In [38]:
for r in d1.iterrows():
    print(r)

(0, Student     A
Marks      90
Name: 0, dtype: object)
(1, Student     B
Marks      80
Name: 1, dtype: object)
(2, Student     C
Marks      40
Name: 2, dtype: object)
(3, Student     D
Marks      60
Name: 3, dtype: object)

In [29]:
for i in d1.itertuples():
    print(i)

Pandas(Index=0, Student='A', Marks=90, Grades='A')
Pandas(Index=1, Student='B', Marks=80, Grades='B')
Pandas(Index=2, Student='C', Marks=70, Grades='C')
Pandas(Index=3, Student='D', Marks=60, Grades='D')

In [34]:
d1.sort_values(by='Marks', ascending=False)

  Student  Marks
0       A     90
1       B     80
3       D     60
2       C     40

In [35]:
result = pd.concat([d1,d2], ignore_index=True)

In [36]:
result.duplicated(subset=['Marks'])

0    False
1    False
2    False
3    False
4    False
5     True
6     True
7     True
dtype: bool